In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
df["cust_id"]

In [ ]:
df["item_bought"]

In [ ]:
df["city"]

In [ ]:
#Creating DataFrame from List of Lists

In [4]:
df = pd.DataFrame([["C1", 10, "Bandung"],
                  ["C2", 15, "Jakarta"],
                  ["C3", 20, "Bogor"],
                  ["C4", 35, "Tangerang"],
                  ["C5", 4, "Bali"]],
                  columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
#Creating DataFrame from Numpy Array

In [ ]:
df = pd.DataFrame(np.array([["C1", 10, "Bandung"],
                  ["C2", 15, "Jakarta"],
                  ["C3", 20, "Bogor"],
                  ["C4", 35, "Tangerang"],
                  ["C5", 4, "Bali"]]),
                  columns = ["cust_id", "item_bought", "city"])
df

In [ ]:
#Creating DataFrame from Dictionary

In [ ]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df

In [ ]:
#Saving a Dataframe

In [ ]:
df.to_csv("customer.csv", index = False)
df.to_excel("customer.xlsx", index = False)

In [ ]:
#Load a Dataframe

In [ ]:
df = pd.read_csv("customer.csv")
df = pd.read_excel("customer.xlsx")

In [ ]:
#Summary Info

In [ ]:
df.info()

In [ ]:
#Statistics of Numerical Columns

In [ ]:
df.describe()

In [ ]:
#Columns Name

In [ ]:
df.columns

In [ ]:
#DataFrame length

In [ ]:
df.shape

In [ ]:
df.shape[0]

In [ ]:
df.shape[1]

In [ ]:
#Values of a particular column

In [ ]:
df["cust_id"]

In [ ]:
#Values of several columns

In [ ]:
df[["cust_id","city"]]

In [ ]:
#First N rows

In [ ]:
df.head()

In [ ]:
df.head(2)

In [ ]:
#Last N rows

In [ ]:
df.tail()

In [ ]:
df.tail(2)

In [ ]:
#Random N Rows

In [ ]:
df.sample()

In [ ]:
df.sample(3)

In [ ]:
#Reordering Columns

In [8]:
df = df[["item_bought", "city", "cust_id"]]
df

   item_bought       city cust_id
0           10    Bandung      C1
1           15    Jakarta      C2
2           20      Bogor      C3
3           35  Tangerang      C4
4            4       Bali      C5

In [ ]:
df = df.reindex(columns=["item_bought", "city", "cust_id"])
df

In [ ]:
#Get the value of specific row and column (via its name)

In [7]:
df.loc[0,"item_bought"]

10

In [12]:
df.loc[3,"city"]

'Tangerang'

In [ ]:
#Get the value of specific row and column (via its index num)

In [9]:
df.iloc[0,0]

10

In [10]:
df.iloc[3,1]

'Tangerang'

In [ ]:
#Get the specific ranges of rows and columns (via its name)

In [11]:
df.loc[0:2,["item_bought","city"]]

   item_bought     city
0           10  Bandung
1           15  Jakarta
2           20    Bogor

In [ ]:
#Get the specific ranges of rows and columns (via its index num)

In [ ]:
df.iloc[0:3,0:2]

In [ ]:
#Filter dataframe with a criteria

In [ ]:
df[df["item_bought"]>15]

In [ ]:
#Filter dataframe with several criterias (AND)

In [ ]:
df[(df["item_bought"]>15) & (df["city"]!= "Bogor")]

In [ ]:
#Filter dataframe with several criterias (OR)

In [ ]:
df[(df["item_bought"]>15) | (df["city"]!= "Bogor")]

In [ ]:
#Check missing values

In [2]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5", "C6"],
    "item_bought": [10,15,20,35,4, np.nan],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bandung", np.nan]
    })
df

NameError: name 'pd' is not defined

In [ ]:
df.isna().sum()

In [ ]:
#Handle Missing Values

In [ ]:
#Remove rows

In [ ]:
df.dropna()

In [ ]:
#Fill with 0 for numerical

In [6]:
df["item_bought"] = df["item_bought"].fillna(0)
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
#Fill with mean/median

In [5]:
df["item_bought"] = df["item_bought"].fillna(df["item_bought"].mean())
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
df["item_bought"] = df["item_bought"].fillna(df["item_bought"].median())
df

In [ ]:
#Fill with mode for categorical

In [ ]:
df["city"] = df["city"].fillna(df["city"].mode()[0])
df

In [ ]:
#Check outliers

In [ ]:
#Z-Score

In [2]:
import scipy.stats as stats

In [3]:
df[(np.abs(stats.zscore(df["item_bought"])) >= 3)]

NameError: name 'df' is not defined

In [ ]:
#IQR

In [ ]:
q1 = df["item_bought"].quantile(0.25)
q3 = df["item_bought"].quantile(0.75)

iqr = q3-q1 #Interquartile range
fence_low  = q1-1.5*iqr
fence_high = q3+1.5*iqr

df.loc[(df["item_bought"] < fence_low) | (df["item_bought"] > fence_high)]

In [ ]:
#Handle Outliers

In [ ]:
#Z-Score
df_clean = df[(np.abs(stats.zscore(df["item_bought"])) < 3)]

#IQR
df_clean = df.loc[(df["item_bought"] >= fence_low) & (df["item_bought"] <= fence_high)]

df_clean

In [ ]:
#Check Duplicates

In [1]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5", "C6", "C7", "C8", "C9", "C10", "C7"],
    "item_bought": [10,7,5,4,10000, 10, 5, 5, 7, 4, 5],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bandung", "Bogor", "Bogor", "Bogor", "Bandung", "Jakarta", "Bogor"]
    })
df

NameError: name 'pd' is not defined

In [4]:
df.duplicated().sum()

NameError: name 'df' is not defined

In [5]:
#Handle Duplicates

In [ ]:
df.drop_duplicates()

In [13]:
df = pd.DataFrame({
    "name": ["Anna", "Dane", "David", "Kevin", "Joe", "Rose"],
    "weight": [45.2, 50.5, 62.1, 64.0, 59.0, np.nan],
    "height": [155, 160, 162, 170, 167, 159],
    "birth_year": [2000,1997,1996,1987,1998,2003],
    "gender": ["female", "male", "male", "male", "male", "female"],
    "city": ["New York", "Chicago", "Austin", "New York", np.nan, "New York"]
    })
df

    name  weight  height  birth_year  gender      city
0   Anna    45.2     155        2000  female  New York
1   Dane    50.5     160        1997    male   Chicago
2  David    62.1     162        1996    male    Austin
3  Kevin    64.0     170        1987    male  New York
4    Joe    59.0     167        1998    male       NaN
5   Rose     NaN     159        2003  female  New York

In [14]:
df[["name", "birth_year", "height", "weight", "city", "gender"]]

    name  birth_year  height  weight      city  gender
0   Anna        2000     155    45.2  New York  female
1   Dane        1997     160    50.5   Chicago    male
2  David        1996     162    62.1    Austin    male
3  Kevin        1987     170    64.0  New York    male
4    Joe        1998     167    59.0       NaN    male
5   Rose        2003     159     NaN  New York  female